In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn
from IPython.display import YouTubeVideo
from pandas_datareader import data, wb
import pandas_datareader as pdweb
import datetime
import seaborn as sns
import matplotlib.pyplot as plt 
from seaborn.regression import coefplot
import sys

In [7]:
dframe = DataFrame({'k1':['x','x','y','y','z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'data_set1':np.random.randn(5),
                   'data_set2':np.random.randn(5)})
dframe

   data_set1  data_set2 k1     k2
0  -0.562079   0.377049  x  alpha
1  -1.567465  -1.755106  x   beta
2   0.364671   0.704253  y  alpha
3  -0.877247   0.125193  y   beta
4   0.927874  -0.099916  z  alpha

In [8]:
group1 = dframe['data_set1'].groupby(dframe['k2'])

In [11]:
group1.mean()

k2
alpha    0.243489
beta    -1.222356
Name: data_set1, dtype: float64

In [12]:
cities = np.array(['NY','LA','LA','NY','NY'])

In [13]:
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [15]:
dframe['data_set1'].groupby([cities,month]).mean()

LA  FEB   -1.567465
    JAN    0.364671
NY  FEB   -0.877247
    JAN    0.182897
Name: data_set1, dtype: float64

In [16]:
dframe.groupby('k1').mean()

    data_set1  data_set2
k1
x   -1.064772  -0.689029
y   -0.256288   0.414723
z    0.927874  -0.099916

In [18]:
dframe.groupby(['k1','k2']).mean()

          data_set1  data_set2
k1 k2
x  alpha  -0.562079   0.377049
   beta   -1.567465  -1.755106
y  alpha   0.364671   0.704253
   beta   -0.877247   0.125193
z  alpha   0.927874  -0.099916

In [19]:
dframe.groupby(['k1']).size()

k1
x    2
y    2
z    1
dtype: int64

In [22]:
dframe

   data_set1  data_set2 k1     k2
0  -0.562079   0.377049  x  alpha
1  -1.567465  -1.755106  x   beta
2   0.364671   0.704253  y  alpha
3  -0.877247   0.125193  y   beta
4   0.927874  -0.099916  z  alpha

In [29]:
for name,group in dframe.groupby('k1'):
    print('This is the %s group of %s type' %(name, type(group)))
    print(group)
    print('\n')

This is the x group of <class 'pandas.core.frame.DataFrame'> type
   data_set1  data_set2 k1     k2
0  -0.562079   0.377049  x  alpha
1  -1.567465  -1.755106  x   beta


This is the y group of <class 'pandas.core.frame.DataFrame'> type
   data_set1  data_set2 k1     k2
2   0.364671   0.704253  y  alpha
3  -0.877247   0.125193  y   beta


This is the z group of <class 'pandas.core.frame.DataFrame'> type
   data_set1  data_set2 k1     k2
4   0.927874  -0.099916  z  alpha

In [31]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

Key1 = x Key2 = alpha
   data_set1  data_set2 k1     k2
0  -0.562079   0.377049  x  alpha


Key1 = x Key2 = beta
   data_set1  data_set2 k1    k2
1  -1.567465  -1.755106  x  beta


Key1 = y Key2 = alpha
   data_set1  data_set2 k1     k2
2   0.364671   0.704253  y  alpha


Key1 = y Key2 = beta
   data_set1  data_set2 k1    k2
3  -0.877247   0.125193  y  beta


Key1 = z Key2 = alpha
   data_set1  data_set2 k1     k2
4   0.927874  -0.099916  z  alpha

In [34]:
group_dict = dict(list(dframe.groupby('k1')))

In [37]:
group_dict['x']

   data_set1  data_set2 k1     k2
0  -0.562079   0.377049  x  alpha
1  -1.567465  -1.755106  x   beta

In [38]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [39]:
group_dict_axis1

{dtype('float64'):    data_set1  data_set2
 0  -0.562079   0.377049
 1  -1.567465  -1.755106
 2   0.364671   0.704253
 3  -0.877247   0.125193
 4   0.927874  -0.099916, dtype('O'):   k1     k2
 0  x  alpha
 1  x   beta
 2  y  alpha
 3  y   beta
 4  z  alpha}

In [40]:
dataset2_group = dframe.groupby(['k1','k2'])[['data_set2']]
dataset2_group.mean()

          data_set2
k1 k2
x  alpha   0.377049
   beta   -1.755106
y  alpha   0.704253
   beta    0.125193
z  alpha  -0.099916